define(function(require){
	/* 神煞矩阵 */
	var sha_map = {
		'天乙贵人': [1,"天乙贵人，最为尊贵，出入近贵，逢凶化吉，名主得之聪明，遇事有人帮助。然女性临此贵人，一位为佳，超过三位会影响自身婚姻。俗称：“两个贵人活动家，三个贵人交际花。”"],
		'太极贵人': [1,"太极贵人又名科名星，命带太极贵人者，聪明好学，喜神秘学术，文史宗教，为人公正禀直，做事善始善终，有契而不舍的执着精神。日坐太极贵人，灵性最强。"],
		'文昌贵人': [1,"文昌入命，主聪明过人，又主逢凶化吉。气质雅秀，举止温文，男命逢着内涵，女命逢着仪容。好学新知，具上进心。一生近官利贵，不与粗俗之辈乱交。"],
		'禄神': [1,"禄神乃福气之星，主享俸禄，衣食无忧，丰盈一生。"],
		'羊刃': [3,"物极必反生羊刃，禄过则刃生。羊刃带禄，又有官印等吉神相助，吉；羊刃遇死绝衰败之时，多有恶病刀兵之害，一生忙碌，凶。"],
		'学堂': [1,"学堂主学业功名，此星入命，科甲及第，大展鸿图。"],
		'金舆': [1,"舆者，车也；金者，贵之之义。譬之君子居官得禄，须坐车载之。此煞乃禄命之旌旗，三才之节钺，主人性柔貌愿，举止温克。妇人逢之，不富即贵；男子得之，多妻妾，阴福相扶持。生日，生时逢之为佳，骨肉平生安泰，得贤妻妾，子孙茂盛。皇族多带此煞，常格得之，身在无气中生，主入赘。——《三命通会》"],
		'红艳煞': [2,'红艳煞又称驳婚煞，就是人的命理上存在婚姻障碍，如果得不到化解，恋爱不顺，婚姻难定，不破解招来都是烂桃花，难得婚姻正果。'],
		'华盖': [3,'华盖有吉有凶，主人聪明勤学，有艺术文章之才，但性格大多孤僻。若华盖逢印绶而临旺相，能在政界有一定的地位；若华盖遇空亡，或遭破坏，则不免为僧道或孤或寡。'],
		'将星': [1,'将星者，如大将驻扎中军也。将星与官杀同柱，掌军政大权；与羊刃同柱，掌生杀大权；与财星同住，掌财政大权。该星与吉神相临愈增其威；与凶星会聚亦增凶星之力。'],
		'驿马': [3,'贵人驿马多升擢，常人驿马主奔波。驿马落空亡，常迁居或更换职业；驿马处死绝之地或遭刑冲，四处漂泊身不安。'],
		'孤辰': [2,'幼而无父曰孤，孤辰者，性格独立，面无和气，不利六亲。'],
		'寡宿': [2,'老而无夫曰寡，寡宿者，婚姻不顺，家庭不睦。'],
		'沐浴桃花': [3,'日主临沐浴之地，生性风流多情，性欲旺盛，追求男欢女爱，一生多艳遇。'],
		'桃花': [3,'命带桃花者，异性缘好。<br>年月支上桃花又称内桃花，主夫妻恩爱。<br>时支桃花又称外桃花，命主外遇情人多，易惹桃色事件。'],
		'阴阳差错煞': [2,'阴阳差错煞主婚姻波折。女子逢之，公姑寡合，妯娌不足，夫家冷退；男子逢之，主退外家，亦与妻家是非寡合。'],
		'魁罡': [3,'魁罡者，制伏群凶及众人之星。有强烈之性情，临事果断，秉权好杀。运行身旺，发福百端。一见财官祸患立至。若日柱魁罡遇刑冲，乃贫寒之士。女逢此星，心性过度刚强，大多克夫，变为寡妇或离婚。'],
		'天德贵人': [1,'凡有天德扶持，能解众凶，主贵显，仁慈，敏惠，大慈善，逢凶化吉，性情温顺，修养高深，重视贞节，福利荣厚。'],
		'月德贵人': [1,'月德贵人所临之地，主福寿，女性逢此，性情温顺贤良，且为有贞操之人，亦有逢凶化吉之妙用。'],
		'劫煞': [2,'劫煞为五行之绝处，命中犯之多破财，惹是非。月时见之最重，年较轻。'],
		'灾煞': [2,'灾煞又称白虎煞，居于冲将星之位，其性勇猛，喜见官星印绶，以生旺为吉。'],
		'空亡': [3,'空亡即空无，缺失。用神吉神逢之，灭喜少吉祥；忌神凶煞逢之，却煞灭凶。'],
		'孤鸾煞': [2,'命犯孤鸾煞，主婚姻不顺。男命叫天煞孤星，女命叫孤鸾煞星（民间俗称“扫帚星”）。'],
	};

	// 天干对地支的神煞
	var ganzhi_sha = 
{/*{{{*/
'甲子': ['太极贵人','沐浴桃花'],
'甲丑': ['天乙贵人'],
'甲寅': ['禄神','孤鸾煞'],
'甲卯': ['羊刃'],
'甲辰': ['金舆'],
'甲巳': ['文昌贵人'],
'甲午': ['太极贵人','红艳煞'],
'甲未': ['天乙贵人'],
'甲申': ['红艳煞'],
'甲酉': [],
'甲戌': [],
'甲亥': ['学堂'],
'乙子': ['太极贵人','天乙贵人'],
'乙丑': [],
'乙寅': ['羊刃'],
'乙卯': ['禄神'],
'乙辰': [],
'乙巳': ['金舆','沐浴桃花','孤鸾煞'],
'乙午': ['太极贵人','文昌贵人','红艳煞','学堂'],
'乙未': [],
'乙申': ['天乙贵人','红艳煞'],
'乙酉': [],
'乙戌': [],
'乙亥': [],
'丙子': ['阴阳差错煞'],
'丙丑': [],
'丙寅': ['红艳煞','学堂'],
'丙卯': ['太极贵人','沐浴桃花'],
'丙辰': [],
'丙巳': ['禄神'],
'丙午': ['羊刃','阴阳差错煞','孤鸾煞'],
'丙未': ['金舆'],
'丙申': ['文昌贵人'],
'丙酉': ['太极贵人','天乙贵人'],
'丙戌': [],
'丙亥': ['天乙贵人'],
'丁子': [],
'丁丑': ['阴阳差错煞'],
'丁寅': [],
'丁卯': ['太极贵人'],
'丁辰': [],
'丁巳': ['羊刃','孤鸾煞'],
'丁午': ['禄神'],
'丁未': ['红艳煞','阴阳差错煞'],
'丁申': ['金舆','沐浴桃花'],
'丁酉': ['太极贵人','天乙贵人','文昌贵人','学堂'],
'丁戌': [],
'丁亥': ['天乙贵人'],
'戊子': [],
'戊丑': ['太极贵人','天乙贵人'],
'戊寅': ['学堂','阴阳差错煞'],
'戊卯': ['沐浴桃花'],
'戊辰': ['太极贵人','红艳煞'],
'戊巳': ['禄神'],
'戊午': ['羊刃','孤鸾煞'],
'戊未': ['太极贵人','天乙贵人','金舆'],
'戊申': ['文昌贵人','阴阳差错煞','孤鸾煞'],
'戊酉': [],
'戊戌': ['太极贵人','魁罡'],
'戊亥': [],
'己子': ['天乙贵人'],
'己丑': ['太极贵人'],
'己寅': [],
'己卯': [],
'己辰': ['太极贵人','红艳煞'],
'己巳': ['羊刃'],
'己午': ['禄神'],
'己未': ['太极贵人'],
'己申': ['天乙贵人','金舆','沐浴桃花'],
'己酉': ['文昌贵人','学堂'],
'己戌': ['太极贵人'],
'己亥': [],
'庚子': [],
'庚丑': ['天乙贵人'],
'庚寅': ['太极贵人'],
'庚卯': [],
'庚辰': ['魁罡'],
'庚巳': ['学堂'],
'庚午': ['沐浴桃花'],
'庚未': ['天乙贵人'],
'庚申': ['禄神'],
'庚酉': ['羊刃'],
'庚戌': ['红艳煞','金舆','魁罡'],
'庚亥': ['太极贵人','文昌贵人'],
'辛子': ['文昌贵人','学堂'],
'辛丑': [],
'辛寅': ['太极贵人','天乙贵人'],
'辛卯': ['阴阳差错煞'],
'辛辰': [],
'辛巳': [],
'辛午': ['天乙贵人'],
'辛未': [],
'辛申': ['羊刃'],
'辛酉': ['禄神','红艳煞','阴阳差错煞'],
'辛戌': [],
'辛亥': ['太极贵人','金舆','沐浴桃花','孤鸾煞'],
'壬子': ['羊刃','红艳煞','孤鸾煞'],
'壬丑': ['金舆'],
'壬寅': ['文昌贵人'],
'壬卯': ['天乙贵人'],
'壬辰': ['阴阳差错煞','魁罡'],
'壬巳': ['太极贵人','天乙贵人'],
'壬午': [],
'壬未': [],
'壬申': ['太极贵人','学堂'],
'壬酉': ['沐浴桃花'],
'壬戌': ['阴阳差错煞'],
'壬亥': ['禄神'],
'癸子': ['禄神'],
'癸丑': [],
'癸寅': ['金舆','沐浴桃花'],
'癸卯': ['天乙贵人','文昌贵人','学堂'],
'癸辰': [],
'癸巳': ['太极贵人','天乙贵人','阴阳差错煞'],
'癸午': [],
'癸未': [],
'癸申': ['太极贵人','红艳煞'],
'癸酉': [],
'癸戌': [],
'癸亥': ['羊刃','阴阳差错煞']
};/*}}}*/

	// 地支对地支的神煞
	var zhizhi_sha = 
{/*{{{*/
'子子': ['将星'],
'子丑': [],
'子寅': ['驿马','孤辰'],
'子卯': [],
'子辰': ['华盖'],
'子巳': ['劫煞'],
'子午': ['灾煞'],
'子未': [],
'子申': [],
'子酉': ['桃花'],
'子戌': ['寡宿'],
'子亥': [],
'丑子': [],
'丑丑': ['华盖'],
'丑寅': ['孤辰','劫煞'],
'丑卯': ['灾煞'],
'丑辰': [],
'丑巳': [],
'丑午': ['桃花'],
'丑未': [],
'丑申': [],
'丑酉': ['将星'],
'丑戌': ['寡宿'],
'丑亥': ['驿马'],
'寅子': ['灾煞'],
'寅丑': ['寡宿'],
'寅寅': [],
'寅卯': ['桃花'],
'寅辰': [],
'寅巳': ['孤辰'],
'寅午': ['将星'],
'寅未': [],
'寅申': ['驿马'],
'寅酉': [],
'寅戌': ['华盖'],
'寅亥': ['劫煞'],
'卯子': ['桃花'],
'卯丑': ['寡宿'],
'卯寅': [],
'卯卯': ['将星'],
'卯辰': [],
'卯巳': ['驿马','孤辰'],
'卯午': [],
'卯未': ['华盖'],
'卯申': ['劫煞'],
'卯酉': ['灾煞'],
'卯戌': [],
'卯亥': [],
'辰子': ['将星'],
'辰丑': ['寡宿'],
'辰寅': ['驿马'],
'辰卯': [],
'辰辰': ['华盖'],
'辰巳': ['孤辰','劫煞'],
'辰午': ['灾煞'],
'辰未': [],
'辰申': [],
'辰酉': ['桃花'],
'辰戌': [],
'辰亥': [],
'巳子': [],
'巳丑': ['华盖'],
'巳寅': ['劫煞'],
'巳卯': ['灾煞'],
'巳辰': ['寡宿'],
'巳巳': [],
'巳午': ['桃花'],
'巳未': [],
'巳申': ['孤辰'],
'巳酉': ['将星'],
'巳戌': [],
'巳亥': ['驿马'],
'午子': ['灾煞'],
'午丑': [],
'午寅': [],
'午卯': ['桃花'],
'午辰': ['寡宿'],
'午巳': [],
'午午': ['将星'],
'午未': [],
'午申': ['驿马','孤辰'],
'午酉': [],
'午戌': ['华盖'],
'午亥': ['劫煞'],
'未子': ['桃花'],
'未丑': [],
'未寅': [],
'未卯': ['将星'],
'未辰': ['寡宿'],
'未巳': ['驿马'],
'未午': [],
'未未': ['华盖'],
'未申': ['孤辰','劫煞'],
'未酉': ['灾煞'],
'未戌': [],
'未亥': [],
'申子': ['将星'],
'申丑': [],
'申寅': ['驿马'],
'申卯': [],
'申辰': ['华盖'],
'申巳': ['劫煞'],
'申午': ['灾煞'],
'申未': ['寡宿'],
'申申': [],
'申酉': ['桃花'],
'申戌': [],
'申亥': ['孤辰'],
'酉子': [],
'酉丑': ['华盖'],
'酉寅': ['劫煞'],
'酉卯': ['灾煞'],
'酉辰': [],
'酉巳': [],
'酉午': ['桃花'],
'酉未': ['寡宿'],
'酉申': [],
'酉酉': ['将星'],
'酉戌': [],
'酉亥': ['驿马','孤辰'],
'戌子': ['灾煞'],
'戌丑': [],
'戌寅': [],
'戌卯': ['桃花'],
'戌辰': [],
'戌巳': [],
'戌午': ['将星'],
'戌未': ['寡宿'],
'戌申': ['驿马'],
'戌酉': [],
'戌戌': ['华盖'],
'戌亥': ['孤辰','劫煞'],
'亥子': ['桃花'],
'亥丑': [],
'亥寅': ['孤辰'],
'亥卯': ['将星'],
'亥辰': [],
'亥巳': ['驿马'],
'亥午': [],
'亥未': ['华盖'],
'亥申': ['劫煞'],
'亥酉': ['灾煞'],
'亥戌': ['寡宿'],
'亥亥': [],
};/*}}}*/

    var o={};

	o.init=function(domid){
		var bzlist = bazi.list;	//!< 八字数组格式[年干支,月干支,日干支,时干支]
		var code = '<table class="shenshatab">'+
			'<tr><th rowspan="2"></th>'+
				'<th colspan="2">年</th>'+
				'<th colspan="2">月</th>'+
				'<th colspan="2">日</th>'+
				'<th colspan="2">时</th></tr>'+
			'<tr><th>干('+bzlist[0]+')</th>'+
				'<th>支('+bzlist[1]+')</th>'+
				'<th>干('+bzlist[2]+')</th>'+
				'<th>支('+bzlist[3]+')</th>'+
				'<th>干('+bzlist[4]+')</th>'+
				'<th>支('+bzlist[5]+')</th>'+
				'<th>干('+bzlist[6]+')</th>'+
				'<th>支('+bzlist[7]+')</th></tr>';
		var sz = ['年','月','日','时'];
		for (var i=0; i<4; ++i) {
			var zhi = bzlist[i*2+1];
			code += '<tr><th>'+sz[i]+'支('+zhi+')</th>';
			for (var k=0;k<4;++k) {
				// 天干见地支
				var cas=[];
				if (k==0 || k==2) {  //!< 以年干或日干看
					var cp = bzlist[k*2]+zhi;
					var shas = ganzhi_sha[cp];
					if (shas && shas.length>0) {
						for (var m=0;m<shas.length;++m) {
							var ss = shas[m];
							// 以下神煞只看日干，不看年干
							if (ss=='禄神'||ss=='羊刃'||ss=='金舆'||ss=='沐浴桃花') {
								if (k!=2) {continue;}
							}
							// 以下神煞只看日柱
							if (ss=='阴阳差错煞') {
								if (k!=2 || i!=2) {continue;}
							}
							// 以下神煞需要干支同柱
							if (ss=='魁罡') {
								if (k!=i) {continue;}
							}
							// 以下神煞只看日柱和时柱
							if (ss=='孤鸾煞') {
								if (k!=i || i==0 || i==1) { continue; }
							}
							cas.push(get_sha_label(ss));
						}
					}
				}
				///////////////////////////////////////////////
				// 天月二德贵人(月支看天干)
				if (i==1) {
					cp = zhi+bzlist[k*2];
					if (in_array(cp,['寅丁','辰壬','巳辛','未甲','申癸','戌丙','亥乙','丑庚'])) {
						cas.push(get_sha_label('天德贵人'));
					}
					if (in_array(cp,['寅丙','卯甲','辰壬','巳庚','午丙','未甲','申壬','酉庚','戌丙','亥甲','子壬','丑庚'])) {
						cas.push(get_sha_label('月德贵人'));
					}
				}
				///////////////////////////////////////////////
				code += '<td>'+cas.join("<br>")+'</td>';
				// 地支见地支
				cas=[];
				if (i==2 && k!=2) {  //!< 只有地支见其他地支才算
					var other_zhi = bzlist[k*2+1];
					cp = zhi+other_zhi;
					shas = zhizhi_sha[cp];
					if (shas && shas.length>0) {
						for (var m=0;m<shas.length;++m) {
							var ss = shas[m];
							if (ss=='灾煞')continue;
							cas.push(get_sha_label(ss));
						}
					}
					// 空亡
					if (in_array(other_zhi,bazi.kongwang)) {
						cas.push(get_sha_label('空亡'));
					}
				}
				if (i==0 && k!=0) {  //!< 灾煞以年支看其余地支
					cp = zhi+bzlist[k*2+1];
					shas = zhizhi_sha[cp];
					if (shas && shas.length>0) {
						if (in_array('灾煞',shas)) {
							cas.push(get_sha_label('灾煞'));
						}
					}
				}
				///////////////////////////////////////////////
				// 天德贵人(月支看其他地支)
				if (i==1 && k!=1) {
					cp = zhi+bzlist[k*2+1];
					if (in_array(cp,['卯申','午亥','酉寅','子巳'])) {
						cas.push(get_sha_label('天德贵人'));
					}
				}
				///////////////////////////////////////////////
				code += '<td>'+cas.join("<br>")+'</td>';
			}
			code += '</tr>';
		}
		code += '</table>';
		jQuery('#'+domid).html(code);
		mwt.popinit();
	};

	// 获取神煞标签
	function get_sha_label(ss) 
	{
		var shaInfo = sha_map[ss];
		if (!shaInfo) return ss;
		var cls = 'success';
		if (shaInfo[0]==2) cls='danger';
		if (shaInfo[0]==3) cls='warning';
		return '<label class="mwt-btn mwt-btn-'+cls+' mwt-btn-xs round" pop-title="'+shaInfo[1]+'" pop-cls="mwt-popover-'+cls+'">'+ss+'</label>';
	}

	return o;
});
