define(function(require){
	/* 神煞矩阵 */
	var sha_map = {
		'天乙贵人': [1,"天乙贵人，最为尊贵，出入近贵，逢凶化吉，名主得之聪明，遇事有人帮助。然女性临此贵人，一位为佳，超过三位会影响自身婚姻。俗称：“两个贵人活动家，三个贵人交际花。”"],
		'太极贵人': [1,"太极贵人又名科名星，命带太极贵人者，聪明好学，喜神秘学术，文史宗教，为人公正禀直，做事善始善终，有契而不舍的执着精神。日坐太极贵人，灵性最强。"],
		'文昌贵人': [1,"文昌入命，主聪明过人，又主逢凶化吉。气质雅秀，举止温文，男命逢着内涵，女命逢着仪容。好学新知，具上进心。一生近官利贵，不与粗俗之辈乱交。"],
		'禄神': [1,"禄神乃福气之星，主享俸禄，衣食无忧，丰盈一生。"],
		'羊刃': [2,"物极必反生羊刃，禄过则刃生。羊刃带禄，又有官印等吉神相助，吉；羊刃遇死绝衰败之时，多有恶病刀兵之害，一生忙碌，凶。"],
		'学堂': [1,"学堂主学业功名，此星入命，科甲及第，大展鸿图。"],
		'金舆': [1,"舆者，车也；金者，贵之之义。譬之君子居官得禄，须坐车载之。此煞乃禄命之旌旗，三才之节钺，主人性柔貌愿，举止温克。妇人逢之，不富即贵；男子得之，多妻妾，阴福相扶持。生日，生时逢之为佳，骨肉平生安泰，得贤妻妾，子孙茂盛。皇族多带此煞，常格得之，身在无气中生，主入赘。——《三命通会》"],
		'红艳煞': [2,'红艳煞又称驳婚煞，就是人的命理上存在婚姻障碍，如果得不到化解，恋爱不顺，婚姻难定，不破解招来都是烂桃花，难得婚姻正果。'],
	};


	// 天干对地支的神煞
	var ganzhi_sha = {
'甲子': ['太极贵人'],
'甲丑': ['天乙贵人'],
'甲寅': ['禄神'],
'甲卯': ['羊刃'],
'甲辰': ['金舆'],
'甲巳': ['文昌贵人'],
'甲午': ['太极贵人','红艳煞'],
'甲未': ['天乙贵人'],
'甲申': ['红艳煞'],
'甲酉': [],
'甲戌': [],
'甲亥': ['学堂'],
'乙子': ['太极贵人','天乙贵人'],
'乙丑': [],
'乙寅': ['羊刃'],
'乙卯': ['禄神'],
'乙辰': [],
'乙巳': ['金舆'],
'乙午': ['太极贵人','文昌贵人','红艳煞','学堂'],
'乙未': [],
'乙申': ['天乙贵人','红艳煞'],
'乙酉': [],
'乙戌': [],
'乙亥': [],
'丙子': [],
'丙丑': [],
'丙寅': ['红艳煞','学堂'],
'丙卯': ['太极贵人'],
'丙辰': [],
'丙巳': ['禄神'],
'丙午': ['羊刃'],
'丙未': ['金舆'],
'丙申': ['文昌贵人'],
'丙酉': ['太极贵人','天乙贵人'],
'丙戌': [],
'丙亥': ['天乙贵人'],
'丁子': [],
'丁丑': [],
'丁寅': [],
'丁卯': ['太极贵人'],
'丁辰': [],
'丁巳': ['羊刃'],
'丁午': ['禄神'],
'丁未': ['红艳煞'],
'丁申': ['金舆'],
'丁酉': ['太极贵人','天乙贵人','文昌贵人','学堂'],
'丁戌': [],
'丁亥': ['天乙贵人'],
'戊子': [],
'戊丑': ['太极贵人','天乙贵人'],
'戊寅': ['学堂'],
'戊卯': [],
'戊辰': ['太极贵人','红艳煞'],
'戊巳': ['禄神'],
'戊午': ['羊刃'],
'戊未': ['太极贵人','天乙贵人','金舆'],
'戊申': ['文昌贵人'],
'戊酉': [],
'戊戌': ['太极贵人'],
'戊亥': [],
'己子': ['天乙贵人'],
'己丑': ['太极贵人'],
'己寅': [],
'己卯': [],
'己辰': ['太极贵人','红艳煞'],
'己巳': ['羊刃'],
'己午': ['禄神'],
'己未': ['太极贵人'],
'己申': ['天乙贵人','金舆'],
'己酉': ['文昌贵人','学堂'],
'己戌': ['太极贵人'],
'己亥': [],
'庚子': [],
'庚丑': ['天乙贵人'],
'庚寅': ['太极贵人'],
'庚卯': [],
'庚辰': [],
'庚巳': ['学堂'],
'庚午': [],
'庚未': ['天乙贵人'],
'庚申': ['禄神'],
'庚酉': ['羊刃'],
'庚戌': ['红艳煞','金舆'],
'庚亥': ['太极贵人','文昌贵人'],
'辛子': ['文昌贵人','学堂'],
'辛丑': [],
'辛寅': ['太极贵人','天乙贵人'],
'辛卯': [],
'辛辰': [],
'辛巳': [],
'辛午': ['天乙贵人'],
'辛未': [],
'辛申': ['羊刃'],
'辛酉': ['禄神','红艳煞'],
'辛戌': [],
'辛亥': ['太极贵人','金舆'],
'壬子': ['羊刃','红艳煞'],
'壬丑': ['金舆'],
'壬寅': ['文昌贵人'],
'壬卯': ['天乙贵人'],
'壬辰': [],
'壬巳': ['太极贵人','天乙贵人'],
'壬午': [],
'壬未': [],
'壬申': ['太极贵人','学堂'],
'壬酉': [],
'壬戌': [],
'壬亥': ['禄神'],
'癸子': ['禄神'],
'癸丑': [],
'癸寅': ['金舆'],
'癸卯': ['天乙贵人','文昌贵人','学堂'],
'癸辰': [],
'癸巳': ['太极贵人','天乙贵人'],
'癸午': [],
'癸未': [],
'癸申': ['太极贵人','红艳煞'],
'癸酉': [],
'癸戌': [],
'癸亥': ['羊刃']
	};


    var o={};

	o.init=function(domid){

		var code = '<table>'+
			'<tr><th rowspan="2"></th>'+
				'<th colspan="2">年</th>'+
				'<th colspan="2">月</th>'+
				'<th colspan="2">日</th>'+
				'<th colspan="2">时</th></tr>'+
			'<tr><th>干('+bazi[0]+')</th>'+
				'<th>支('+bazi[1]+')</th>'+
				'<th>干('+bazi[2]+')</th>'+
				'<th>支('+bazi[3]+')</th>'+
				'<th>干('+bazi[4]+')</th>'+
				'<th>支('+bazi[5]+')</th>'+
				'<th>干('+bazi[6]+')</th>'+
				'<th>支('+bazi[7]+')</th></tr>';
		var sz = ['年','月','日','时'];

		for (var i=0; i<4; ++i) {
			var zhi = bazi[i*2+1];
			code += '<tr><th>'+sz[i]+'支('+zhi+')</th>';
			
			for (var k=0;k<8;++k) {
				var cp = bazi[k]+zhi;
				var cas=[];
				// 地支对地支
				if (k%2==1) {
				}
				// 天干对地支
				else {
					if (k==0 || k==4) {
						var shas = ganzhi_sha[cp];
						if (shas && shas.length>0) {
							for (var m=0;m<shas.length;++m) {
								var ss = shas[m];
								if (k==0) {
									// 以下神煞只看日干，不看年干
									if (ss=='禄神'||ss=='羊刃'||ss=='金舆') {
										continue;
									}
								}
								var shaInfo = sha_map[ss];
								if (shaInfo) {
									var cls = 'success';
									if (shaInfo[0]==2) cls='danger';
									ss = '<label class="mwt-btn mwt-btn-'+cls+' mwt-btn-xs" pop-title="'+shaInfo[1]+'" pop-cls="mwt-popover-'+cls+'">'+ss+'</label>';
								}
								cas.push(ss);
							}
						}
					} 
				}
				code += '<td>'+cas.join("<br>")+'</td>';
			}

			code += '</tr>';
		}
		code += '</table>';
		jQuery('#'+domid).html(code);
		mwt.popinit();
	};

	return o;
});
