<?php
/**
 * 安装程序调用,八字诀表数据
 **/

$table = DB::table('bazi_jue');
$cols = '(`jueid`,`cate`,`nature`,`name`,`desc`)';

// 八字婚恋诀
$cate = '婚恋';
$sql = "INSERT IGNORE INTO $table $cols VALUES ".<<<EOF
(200001,'$cate',-1,'命局配偶星不显','命局配偶星不显，成婚不易，有晚婚之象。'),
(200002,'$cate',1,'命局配偶星多','命局配偶星多，异性缘好。'),
(200003,'$cate',-1,'女命官杀混杂','女命官杀混杂，异性缘佳，会经历多个男人，有离婚之象。'),
(200004,'$cate',-1,'男命正偏财透天干','男命正偏财透天干，妻妾兼备，有离婚之象。'),
(200005,'$cate',-1,'男命比劫重重','男命比劫重重，有克妻之象，婚姻不顺。'),

(200101,'$cate',-1,'配偶宫被刑冲','配偶宫被刑冲，主婚姻不顺，宜晚婚。'),
(200102,'$cate',-1,'配偶宫多合','配偶宫多合，配偶有离婚之象。'),

(200301,'$cate',1,'沐浴桃花','日坐沐浴桃花，命主生性风流多情，有异性魅力，追求男欢女爱，一生多艳遇。'),
(200302,'$cate',1,'内桃花','内桃花，主夫妻恩爱，如胶似膝，形影不离，相敬如宾。'),
(200303,'$cate',1,'外桃花','外桃花，多外遇情人，为人风流浪漫。'),

(200401,'$cate',-1,'伤官星多','伤官星多，命主不喜束缚，追求性自由合，易生婚变。'),
(200402,'$cate',-1,'伤官见官','女命伤官见官，不利夫君，易再婚。'),
(200403,'$cate',-1,'月令伤官','女逢伤官易再嫁。'),

(200501,'$cate',-1,'阴阳差错煞','阴阳差错煞主婚姻波折。女子逢之，公姑寡合，妯娌不足，夫家冷退；男子逢之，主退外家，亦与妻家是非寡合。'),
(200502,'$cate',-1,'孤鸾煞','孤鸾煞主婚姻不顺。男命叫天煞孤星，女命叫孤鸾煞星。'),
(200503,'$cate',-1,'红艳煞','红艳主人风流好色，人命犯之，多数有外遇桃花。女命见之，难免私情，婚前失贞。'),

(200601,'$cate',1,'命局多合','命局多合，有多段婚姻之象，宜晚婚。')
EOF;
runquery($sql);


